{
  "cask_time_hour": "Hour",
  "cask_time_minute": "Minute",
  "test_component_switch_theme": "Switch theme",
  "test_component_switch_lang": "Switch language",
  "test_component_upload": "Upload",
  "test_component_import": "Import",
  "test_component_show_more": "Show more",
  "test_component_search": "Search",
  "test_component_go_to": "Go to",
  "test_component_m_go_to": "Multiple Go to",
  "test_component_show_dialog": "Show Dialog",
  "test_component_multiple_open": "Open multiple select",
  "test_component_multiple_close": "Close multiple select",
  "test_component_multiple_operation": "Multiple selected operation",

  "in_develop": "This feature is under development. Stay tuned",
  "error_request": "The system is busy. Please try again later.",

  "file_upload_error_message": "The file does not meet the requirements, please upload again",
  "file_upload_title": "Drag and drop files here or click for upload",
  "complex_table_no_data": "No data available",
  "complex_table_page_size": "Page size",
  "complex_table_total_data": "Total rows",
  "complex_table_change_column_visible": "Column Visible Setting",
  "complex_table_more_setting": "More Setting",
  "complex_table_at_least_column": "Please retain at least one column of observable data",

  "main_title": "AsterCasc",
  "main_login":"Sign in",
  "main_create_account":"Create account",
  "main_logout": "Sign out",
  "main_pre_version": "Previous Version",
  "main_articles": "Articles",
  "main_tools": "Toolkit",
  "main_videos": "Videos",
  "main_board": "Guestbook",
  "main_chat_room": "Chatroom",
  "main_subtitle": "Those little hands, without us knowing, have grown stronger than both you and me. Passing through the vine-covered corridor, bidding farewell to the tear-filled days",
  "main_top_content": "Discovering truth through practice, then confirming and developing truth through practice once again. From perceptual knowledge, we actively progress to rational understanding, which then actively guides practice to transform both the subjective and objective worlds. This cycle of practice, understanding, more practice, and further understanding continues endlessly. With each cycle, the content of both practice and understanding advances to a relatively higher level. This is the complete epistemology of dialectical materialism; it is the dialectical materialist view of the unity of knowledge and action",
  "main_web_desc": "Showcasing practices in software development, coding, and cross-platform applications. Explore projects, blogs, and technical tutorials that delve into innovative tech solutions and programming insights",

  "main_setting_title": "Setting",
  "main_setting_show_scroller": "Fullscreen still displays scroller :",
  "main_setting_theme": "Theme selection :",
  "main_setting_save_login_data": "Save login status :",
  "main_setting_lang": "Page language :",
  "main_setting_yes": "Yes",
  "main_setting_no": "No",
  "main_setting_theme_light": "Light",
  "main_setting_theme_dark": "Dark",
  "main_setting_theme_green": "Green",

  "main_login_subtitle_pre": "The current new version of the page temporarily does not support registration. Please proceed to the",
  "main_login_subtitle_center": "previous version",
  "main_login_subtitle_post": "to register",
  "main_login_account": "Account",
  "main_login_password": "Password",
  "main_login_privacy_pre": "I agree to",
  "main_login_privacy_center": "privacy policy and terms",
  "main_login_more": "Or",

  "main-fa-mail": "Mail",
  "main-fa-wechat": "WeChat",
  "main-fa-qq": "QQ",

  "main_tools_qrcode_gen": "QRCode Generator and Parse",
  "main_tools_qrcode_gen_desc": "You can convert text into a QR code, customize its style, generate a QR code with your own colors, and support QR code decoding.",
  "main_tools_rgb_con": "RGB and Hexadecimal Conversion",
  "main_tools_rgb_con_desc": "Used to convert RGB or RGBA color representations into hexadecimal color notation, and also to convert hexadecimal color notation into the corresponding RGB format.",
  "main_tools_base64_con": "Base64 Image Conversion",
  "main_tools_base64_con_desc": "Allows uploaded images to be converted into Base64 format, and also enables converting Base64 files back to images with a download option.",
  "main_tools_md5_gen": "Text Hashing",
  "main_tools_md5_gen_desc": "Used to hash the obtained string using message digest algorithms or hash algorithms, including MD5, SHA-1, and Keccak-256.",
  "main_tools_time_con": "Timestamp Converter",
  "main_tools_time_con_desc": "",

  "main_tools_game_hex": "Hextris",
  "main_tools_game_hex_desc": "A color-matching mini-game similar to Tetris. Once you enter, you can check the gameplay instructions and source code in the top-left corner. Currently, it doesn't support server-side score saving, and everyone's scores are stored locally. A global leaderboard system will be added later. It is recommended to play on a computer since the mobile version lacks a speed-up key (which might be added in the future), making it harder to achieve higher scores.",
  "main_tools_game_miku": "Mikutap",
  "main_tools_game_miku_desc": "Stress Relief Game, A music simulation game developed by a Japanese creator. Players can trigger different musical scales and generate various visuals by tapping and swiping. The fullscreen mode can be accessed from the top-right corner, and the experience is best enjoyed on a mobile device or in fullscreen mode.",

  "main-nav-ipc-pre": "Internet ICP Filing: ",
  "main-nav-ipc-center": "Zhejiang ICP No. 2022023127",
  "main-nav-personal-res": "Personal Repositories",
  "main-nav-contact-me": "Contacts me",
  "main-nav-game": "Games",
  "main-nav-tool": "Toolkits",
  "main-nav-quick-link": "Quick Links",
  "main-nav-article": "Technical Articles",
  "main-nav-essay": "Personal Essays",
  "main-nav-toolkit": "Utility Toolkit",
  "main-nav-video": "Videos",

  "route-more": "View More",
  "route-more-list": "Explore",
  "route-tool": "To Try",
  "route-game": "To Play",


  "subtitle-1": "Justice means that everyone does what they are naturally suited for and refrains from meddling in the work of others. It’s not about force, but harmony within the soul and the city.",
  "subtitle-2": "Happiness is the activity of the soul in accordance with virtue, and if there are multiple virtues, in accordance with the best and most complete one over a lifetime.",
  "subtitle-3": "Become who you are by constantly breaking the shackles of your old self. Pain may accompany you, but only through trials can the soul find its true meaning and become the Übermensch.",
  "subtitle-4": "Man is not merely in the world; he is engaged with it. The way one understands oneself determines how one understands being and the world one inhabits.",
  "subtitle-5": "True freedom is not acting at whim but in accordance with reason. Understanding the necessity of nature and accepting it is the path to true liberty.",
  "subtitle-6": "Heaven and Earth are unkind; they regard the myriad things as straw dogs. The space between Heaven and Earth is like a bellows; empty but inexhaustible, the more it moves, the more it yields.",
  "subtitle-7": "The gentleman has no firm likes or dislikes; he is guided by what is right. A gentleman’s friendship is as light as water; a petty man’s is as sweet as wine.",
  "subtitle-8": "The way of the art lies in transmitting heart to heart, not mind to mind. If the beginner’s mind is lost, the craft loses its soul; only by keeping the beginner’s mind can the art blossom endlessly.",
  "subtitle-9": "Man is born free, and everywhere he is in chains. The task of every just society is to balance freedom and order without compromising the natural liberty of the individual.",
  "subtitle-10": "What you resist persists; what you accept transforms. The soul must navigate the contradictions within itself and find reconciliation to achieve maturity.",


  "home": "Home"
}